Revit 2027 API
Wall.GetStackedWallMemberIds Method
 Get the sub walls which belongs to the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetStackedWallMemberIds()
Public Function GetStackedWallMemberIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetStackedWallMemberIds()
member GetStackedWallMemberIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 If the wall is a stacked wall, the Ids of the sub will be returned in bottom-top order.
Exceptions
Exception | Condition
InvalidOperationException |  This wall isn't a consistent stacked wall.
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace